//#include<stdio.h>
//int main()
//{
//	//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：
//	//A选手说：B第二，我第三；
//	//B选手说：我第二，E第四；
//	//C选手说：我第一，D第二；
//	//D选手说：C最后，我第三；
//	//E选手说：我第四，A第一；
//	//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	int e = 0;
//	for (a = 1; a <=5; a++)
//	{
//		for (b = 1; b <= 5; b++)
//		{
//			for (c = 1; c <= 5; c++)
//			{
//				for (d = 1; d <= 5; d++)
//				{
//					for (e = 1; e <= 5; e++)
//					{
//						if (((b == 2) +(a == 3)==1)&& ((b == 2) + (e == 4)==1)&& ((c == 1) +( d == 2)==1)&& ((c == 5) +( d == 3)==1)&& ((e == 4 )+ (a == 1)==1))
//						{
//							if (a * b * c * d * e == 120)
//							{
//								printf("a=%d,b=%d,c=%d,d=%d,e=%d", a, b, c, d, e);
//							}
//						}
//					}
//				}
//			}
//		}
//	}
//	return 0;
//}


//#include <stdio.h>
//#define N 6
////使用二维数组
//int main()
//{
//	int data[N][N];
//	int i, j, k;
//	data[0][0] = 1;
//	data[1][0] = 1;
//	data[1][1] = 1;
//	for (i = 1; i < N; i++)
//	{
//		for (j = 0; j < i + 1; j++)
//		{
//			if (j == 0 || j == i)
//			{
//				data[i][j] = 1;
//			}
//			else
//			{
//				data[i][j] = data[i - 1][j - 1] + data[i - 1][j];
//			}
//		}
//	}
//	printf("当N为6时，杨辉三角如下：\n");
//	for (i = 0; i < N; i++)
//	{
//		for (k = 0; k < N - i - 1; k++)
//		{
//			printf("  ");
//		}
//		for (j = 0; j < i + 1; j++)
//		{
//			printf("%4d", data[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}

//
//#include<stdio.h>
//int main()
//{
//	/*日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。
//	以下为4个嫌疑犯的供词:
//	A说：不是我。
//	B说：是C。
//	C说：是D。
//	D说：C在胡说
//	已知3个人说了真话，1个人说的是假话。
//	现在请根据这些信息，写一个程序来确定到底谁是凶手*/
//	int i = 0, a = 0, b = 0, c = 0, d = 0;//1 表示凶手，0 表示清白者
//	int m = 0;//m为矛盾，
//	for (i = 1; i <= 4; i++)//在这里有4种可能，所以用for循环循环四次
//	{
//		if (i == 1)//假设A说了谎
//		{
//			a = 1; c = 1; m = 1; d = 0;
//		}
//		if (i == 2)//假设B说了谎
//		{
//			a = 0; c = 0; m = 1; d = 0;
//		}
//		if (i == 3)//假设C说了慌
//		{
//			a = 0; c = 1; m = 0; d = 0;
//		}
//		if (i == 4)//假设D说了慌
//		{
//			a = 0; c = 1; m = 1; d = 0;
//		}
//		if ((a + b + c + d + m == 1) && (m == d))
//		{
//			printf("A=%d B=%d C=%d D=%d", a, b, c, d);
//		}
//	}
//	return 0;
//}

