#include <stdio.h>
//void main()
//{
//    /*考生在此行下设计程序，不得删除本行*/
//	//键盘输入一个用电量x（设大于0），计算并输出电费y的值。
//  double x=0;
//  double y=0;
//	scanf("%lf",&x);
//  if(x>0)
//  {
// if(x>0&&x<=180)
// {
//	y=0.57*x;
// }
// else if(x>180&&x<=240)
// {
//	y=0.62*x-9;
// }
// else
//	 y=0.8*x-52.2;
//  }
//  else
//	  printf("用电量不能为负数");
//  printf("%.2lf",y);
//}

//void main()
//{
//   /*考生在此行下设计程序，不得删除本行*/
//	int s=0;
//	int n=0;
//	while(s<2021)
//	{
//		n=n+1;
//		s+=2*n-1;
//	}
//	printf("%d",n-1);
//}
//void main()
//{
//    /*各班学生人数*/
//	int a[38]={65,66,67,61,64,62,68,64,67,69,70,62,65,64,69,61,60,61,66,64,67,69,72,62,75,62,67,66,63,65,64,69,61,60,61,66,64,67};
//	/*各班接种疫苗人数*/
//	int b[38]={62,63,60,58,59,54,66,63,59,57,65,56,59,51,50,51,56,54,57,58,64,62,70,60,71,60,62,62,58,65,61,63,57,56,58,65,61,62};
//	/*考生在此行下设计程序，不得删除本行*/
//	int s=0;
//	int m=0;
//	int i=0;
//	for(i=0;i<38;i++)
//	{
//		s+=b[i];
//		m+=a[i];
//	}
//	printf("全校接种疫苗人数：%d\n接种疫苗百分比：%.2lf%%\n",s,100.0*s/m);
//}
//void main()
//{
//    /*考生在此行下设计程序，不允许删除该行*/
// int a=0;
// scanf("%d",&a);
// switch(a)
// {
// case 1:
// case 3:
// case 5:printf("31");break;
// case 2:printf("29");break;
// case 4:
// case 6:printf("30");break;
// default:printf("输入错误");break;
// } 
//}
//void main()
//{
//       /*考生在此行下设计程序，不得删除本行*/
//	int i=1;
//	double s=0.0;
//	int f1=1;
//	int f2=1;
//	int f3=0;
//	for(i=1;i<41;i++)
//	{
//		s+=1.0*f1/f2;
//		f3=f1+f2;
//		f1=f2;
//		f2=f3;
//	}
//	printf("%.4lf",s);
//}

//void main()
//{
//	int a[100]={1059,334,906,854,702,803,303,646,603,881,628,870,617,620,253,463,1091,960,
//		382,924,132,573,327,906,911,370,420,155,656,381,416,333,271,504,222,927,754,846,
//		1027,572,703,119,726,383,393,791,792,104,210,943,968,159,462,1039,434,942,808,107,
//		107,386,298,869,159,383,506,367,521,104,924,1069,786,970,112,670,775,704,836,610,
//		860,332,462,359,482,1060,685,718,567,1055,358,990,981,111,292,946,113,949,299,796,418,783};
//	/*考生在此行下设计程序，不得删除本行*/
//  int total=0;
//  double average=0.0;
//  int i=0;
//  int n=0;
//  for(i=0;i<100;i++)
//  {
//	total+=a[i];
//	if(a[i]>900)
//		n++;
//  }
//  printf("用电总量：%d\n平均值：%.2lf\n用电量大于900：%d\n",total,total/100.0,n); 
//}
//void main()
//{
//    /*考生在此行下设计程序，不允许删除该行*/
//	int a=0;
//	scanf("%d",&a);
//	if(a<0)
//		printf("输入错误");
//	else
//	{
//	if(a%2==0)
//		printf("是偶数");
//	else
//		printf("是奇数");
//	}
//}

//void main()
//{
//     /*考生在此行下设计程序，不得删除本行*/
// double s=1;
//	int i=1;
//	int t=-3;
// for(i=1;i<19;i++)
// {
//	s+=t*1.0/(2*i+1);
//	t=-3*t;
// }
// printf("%.5lf",s);
//}

//void main()
//{
//	/*销售数量*/
//	int a[30]={53,75,38,28,111,37,68,51,127,66,86,115,19,63,174,12,24,32,100,16,52,75,46,18,125,37,118,55,130,45};
//	/*对应单价*/
//	double b[30]={12.5,11.9,18,13.5,6.5,16,72.5,23.4,51,45,14.5,18.8,48.8,35.5,28,16.8,19.8,12.2,8.2,81.6,15.2,56,87,23.7,14.5,19.7,35.7,5.6,28.5,23.1}; 
//	/*考生在此行下设计程序，不得删除本行*/
//	int c[30];
//	int i=0;
//	double s=0.0;
//	for(i=0;i<30;i++)
//	{
//		if(a[i]<100)
//		{
//			c[i]=100-a[i];
//			s+=c[i]*b[i];
//		}
//		else
//			c[i]=0;
//	}
//	printf("%.2lf",s);
//}

//void main()
//{
//    /*考生在此行下设计程序，不允许删除该行*/
// int x=0;
// double y=0.0;
// scanf("%d",&x);
// if(x<0)
//	 printf("输入有误，请重新输入\n");
// else
// {
//	if(x<100)
//		y=x;
//	else if(x>=100&&x<200)
//		y=0.95*x;
//	else if(x>=200&&x<400)
//		y=0.9*x;
//	else
//		y=0.85*x;
// }
// printf("%lf",y);
//}

//void main()
//{
//      /*考生在此行下设计程序，不得删除本行*/
//  int s=0;
//  int i=0;
//  int n=0;
//  int a=0;
//  int t=0;
//  scanf("%d %d",&n,&a);
//  if(a>=1&&a<=9)
//  {
//  for(i=0;i<n;i++)
//  {
//	  t=t*10+a; 
//	  s+=t;
//  }
//  printf("%d",s);
//  }
//  else
//	  printf("输入有误");
//}
void main()
{
	/*班级高考成绩数据*/
	int a[50]={588,435,487,561,597,455,484,617,478,512,639,441,408,592,489,439,407,584,570,525,
               628,593,408,603,596,523,448,602,460,513,618,623,478,532,539,647,428,485,523,468,
		       462,585,517,580,596,593,533,554,590,433};
	/*对应性别数据，0 - 女生，1 - 男生*/
    int b[50]={1,0,0,0,1,0,1,1,0,1,0,1,0,1,0,0,1,0,0,0,1,1,0,0,1,
			   1,1,0,0,0,0,1,0,0,1,0,1,1,0,1,1,0,1,0,0,1,0,1,1,0};
   /*考生在此行下设计程序，不得删除本行*/
  int i=0;
  int nan=0;
  int nv=0;
   double s=0.0;
   double m=0.0;
  for(i=0;i<50;i++)
  {
	if(b[i]==1)
	{
		s+=a[i];
		nan++;
	}
	else
	{
		m+=a[i];
		nv++;
	}
  }
  printf("男生与女生平均分相差：%.1lf",(1.0*s/nan)-(1.0*m/nv));
}